app/controllers/users_controller.rb

SELECT `user`.* FROM `user` WHERE ( email = 'tranquoccong142@gmail.com' AND password ='9f76b1a2150217bc03c8d79fbd247f4a') LIMIT 1
---
  def sign_in_account
    email = params[:email]
    pass = params[:pass]

    res = {:error => 1, :description => MSG_USER_PASS_INCORRECT}
    if email and pass
      email = email.to_s.strip.downcase
      h_pass = Digest::MD5.hexdigest(pass)
      sql = " email = '" + email.to_s + "' AND password ='" + h_pass.to_s + "'"
      user = Users.where(sql).first

SELECT `users`.* FROM `users` WHERE (email = 'congtran@flomail.net') LIMIT 1
INSERT INTO `users` (`lastName`, `email`, `password`, `createdDate`, `updatedDate`, `recoveryToken`, `accountType`, `firstName`, `activateStatus`, `activateToken`) VALUES ('tran', 'congtran@flomail.net', '9f76b1a2150217bc03c8d79fbd247f4a', 1534347805, 1534347805, '', 0, 'cong', 0, '99993dda0152fe023ae8c40f859c51ed')
---
  def register
    email = params[:email]
    pass = params[:password]
    lname = params[:lname]
    fname = params[:fname]
    if email and pass
      email = email.to_s.strip.downcase
      h_pass = Digest::MD5.hexdigest(pass)
      #check email existed
      sql = "email = '" + email.to_s + "'"
      user = Users.where(sql).first
      #user existed
      if user and user.id
        res = {:error => 1, :description => MSG_USER_EXISTED}
        respond_to do |format|
          format.xml { render :xml => res.to_xml()}
          format.json { render :json => res.to_json()}
        end
      else #create new user
        #save user into DB
        arr = email.split('@')
        uname = arr[0].to_s #set default name for user
        usr = Users.new()
        usr.email = email
        usr.password = h_pass
        usr.lastName = (lname and lname.to_s.strip != '') ? lname.to_s.strip : ''
        usr.firstName = (fname and fname.to_s.strip != '') ? fname.to_s.strip : uname
        usr.activateToken = Digest::MD5.hexdigest(ActiveSupport::SecureRandom.hex(16))
        if usr.save

SELECT `users`.* FROM `users` WHERE (activateToken = '4e1879c4f4df035b27dad9f0fcc7ab52' ) LIMIT 1
UPDATE `users` SET `activateStatus` = 1, `updatedDate` = 1534867801 WHERE `users`.`id` = 5
---
  def activate
    message = ''
    actCode = params[:activationToken]
    if actCode and actCode.to_s.strip != ''
      user = Users.where('activateToken = ? ', actCode).first
      if user and user.id
        if user.activateStatus.to_i == 0
          user.activateStatus = 1
          user.update_attributes(user)

SELECT `user`.* FROM `user` WHERE (email = 'tranquoccong142@gmail.com') LIMIT 1
---
  def check_exist
    email = params[:email]
    res = {:error => 0, :description => MSG_USER_NOT_EXIST}
    if email
      email = email.to_s.strip.downcase
      sql = "email = '" + email.to_s + "'"
      user = Users.where(sql).first