app/controllers/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'congtran' ORDER BY `users`.`id` ASC LIMIT 1
---
  def sign_in_account
    email = params[:email]
    pass = params[:pass]

    res = {:error => 1, :description => MSG_USER_PASS_INCORRECT}
    if email and pass
      email = email.to_s.strip.downcase
      h_pass = Digest::MD5.hexdigest(pass)
      sql = " email = '" + email.to_s + "' AND password ='" + h_pass.to_s + "'"
      user = User.where(email: email.to_s).first

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'tranquoccong142@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`activateToken`, `createdDate`, `email`, `firstName`, `lastName`, `password`, `updatedDate`) VALUES ('d329766b34d6b7a1731e6cc51c4c64ba', 1536056239, 'tranquoccong142@gmail.com', 'gdf', 'gfdgfdgdfgdfgdfg', '9f76b1a2150217bc03c8d79fbd247f4a', 1536056239)
---
  def register
    email = params[:email]
    pass = params[:password]
    lname = params[:lname]
    fname = params[:fname]
    if email and pass
      email = email.to_s.strip.downcase
      h_pass = Digest::MD5.hexdigest(pass)
      #check email existed
      sql = "email = '" + email.to_s + "'"
      user = User.where(email: email.to_s).first
      #user existed
      if user and user.id
        res = {:error => 1, :description => MSG_USER_EXISTED}
        respond_to do |format|
          format.xml { render :xml => res.to_xml()}
          format.json { render :json => res.to_json()}
        end
      else #create new user
        #save user into DB
        arr = email.split('@')
        uname = arr[0].to_s #set default name for user
        usr = User.new()
        usr.email = email
        usr.password = h_pass
        usr.lastName = (lname and lname.to_s.strip != '') ? lname.to_s.strip : ''
        usr.firstName = (fname and fname.to_s.strip != '') ? fname.to_s.strip : uname
        usr.activateToken = Digest::MD5.hexdigest(SecureRandom.hex(16))
        if usr.save

SELECT `users`.* FROM `users` WHERE `users`.`activateToken` = '1c5bcdca47bc1638946a2273e25e815a' ORDER BY `users`.`id` ASC LIMIT 1
---
  def activate
    message = ''
    actCode = params[:activationToken]
    if actCode and actCode.to_s.strip != ''
      user = User.where(activateToken: actCode).first

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'cong@flomail.net' ORDER BY `users`.`id` ASC LIMIT 1
---
  def check_exist
    email = params[:email]
    res = {:error => 0, :description => MSG_USER_NOT_EXIST}
    if email
      email = email.to_s.strip.downcase
      sql = "email = '" + email.to_s + "'"
      user = User.where(email: email.to_s).first